In [2]:
import pandas as pd
df=pd.read_csv("students.csv")
df

,StudentID,Name,Age,Email,Department,GPA,GraduationYear
0,3336,David Palmer,19,sean43@hotmail.com,Mathematics,3.16,2026
1,8774,Andrew Roach,23,vbecker@harvey.com,Chemistry,3.75,2027
2,1396,Jonathan Gonzalez,22,hollydavis@gmail.com,Physics,2.95,2027
3,6716,Kenneth Morrow,24,ganderson@wheeler-atkins.info,Physics,3.55,2029
4,8830,Kaitlyn Martinez,18,hayesdiane@gmail.com,Chemistry,2.29,2025
...,...,...,...,...,...,...,...
195,3274,Catherine Velasquez,22,fsutton@gmail.com,Physics,2.71,2025
196,3609,Joyce Thomas,19,zanderson@barrera.net,Chemistry,2.22,2030
197,9179,Theresa Hughes,21,mstanley@yahoo.com,Mathematics,3.23,2025
198,4463,Steven Golden,19,nvasquez@yahoo.com,Computer Science,3.90,2025
199,6178,Miss April Smith,20,logansanchez@manning.com,Mathematics,3.15,2028

In [3]:
df.describe

<bound method NDFrame.describe of      StudentID                 Name  Age                          Email  \
0         3336         David Palmer   19             sean43@hotmail.com
1         8774         Andrew Roach   23             vbecker@harvey.com
2         1396    Jonathan Gonzalez   22           hollydavis@gmail.com
3         6716       Kenneth Morrow   24  ganderson@wheeler-atkins.info
4         8830     Kaitlyn Martinez   18           hayesdiane@gmail.com
..         ...                  ...  ...                            ...
195       3274  Catherine Velasquez   22              fsutton@gmail.com
196       3609         Joyce Thomas   19          zanderson@barrera.net
197       9179       Theresa Hughes   21             mstanley@yahoo.com
198       4463        Steven Golden   19             nvasquez@yahoo.com
199       6178     Miss April Smith   20       logansanchez@manning.com

           Department   GPA  GraduationYear
0         Mathematics  3.16            2026
1           Chemistry  3.75            2027
2             Physics  2.95            2027
3             Physics  3.55            2029
4           Chemistry  2.29            2025
..                ...   ...             ...
195           Physics  2.71            2025
196         Chemistry  2.22            2030
197       Mathematics  3.23            2025
198  Computer Science  3.90            2025
199       Mathematics  3.15            2028

[200 rows x 7 columns]>

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StudentID       200 non-null    int64
 1   Name            200 non-null    object
 2   Age             200 non-null    int64
 3   Email           200 non-null    object
 4   Department      200 non-null    object
 5   GPA             200 non-null    float64
 6   GraduationYear  200 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 8.7+ KB

In [5]:
df.isnull()

     StudentID   Name    Age  Email  Department    GPA  GraduationYear
0        False  False  False  False       False  False           False
1        False  False  False  False       False  False           False
2        False  False  False  False       False  False           False
3        False  False  False  False       False  False           False
4        False  False  False  False       False  False           False
..         ...    ...    ...    ...         ...    ...             ...
195      False  False  False  False       False  False           False
196      False  False  False  False       False  False           False
197      False  False  False  False       False  False           False
198      False  False  False  False       False  False           False
199      False  False  False  False       False  False           False

[200 rows x 7 columns]

In [8]:
df.tail(5)

,StudentID,Name,Age,Email,Department,GPA,GraduationYear
195,3274,Catherine Velasquez,22,fsutton@gmail.com,Physics,2.71,2025
196,3609,Joyce Thomas,19,zanderson@barrera.net,Chemistry,2.22,2030
197,9179,Theresa Hughes,21,mstanley@yahoo.com,Mathematics,3.23,2025
198,4463,Steven Golden,19,nvasquez@yahoo.com,Computer Science,3.90,2025
199,6178,Miss April Smith,20,logansanchez@manning.com,Mathematics,3.15,2028

In [9]:
df.head(5)

,StudentID,Name,Age,Email,Department,GPA,GraduationYear
0,3336,David Palmer,19,sean43@hotmail.com,Mathematics,3.16,2026
1,8774,Andrew Roach,23,vbecker@harvey.com,Chemistry,3.75,2027
2,1396,Jonathan Gonzalez,22,hollydavis@gmail.com,Physics,2.95,2027
3,6716,Kenneth Morrow,24,ganderson@wheeler-atkins.info,Physics,3.55,2029
4,8830,Kaitlyn Martinez,18,hayesdiane@gmail.com,Chemistry,2.29,2025

In [10]:
df.describe()

         StudentID         Age        GPA  GraduationYear
count   200.000000  200.000000  200.00000      200.000000
mean   5726.460000   21.580000    3.02785     2027.180000
std    2507.407622    2.267002    0.59112        2.011924
min    1066.000000   18.000000    2.00000     2024.000000
25%    3693.000000   20.000000    2.52500     2025.000000
50%    5641.000000   22.000000    3.08000     2027.000000
75%    8025.750000   24.000000    3.51000     2029.000000
max    9985.000000   25.000000    3.99000     2030.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StudentID       200 non-null    int64
 1   Name            200 non-null    object
 2   Age             200 non-null    int64
 3   Email           200 non-null    object
 4   Department      200 non-null    object
 5   GPA             200 non-null    float64
 6   GraduationYear  200 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 8.7+ KB

In [12]:
df

,StudentID,Name,Age,Email,Department,GPA,GraduationYear
0,3336,David Palmer,19,sean43@hotmail.com,Mathematics,3.16,2026
1,8774,Andrew Roach,23,vbecker@harvey.com,Chemistry,3.75,2027
2,1396,Jonathan Gonzalez,22,hollydavis@gmail.com,Physics,2.95,2027
3,6716,Kenneth Morrow,24,ganderson@wheeler-atkins.info,Physics,3.55,2029
4,8830,Kaitlyn Martinez,18,hayesdiane@gmail.com,Chemistry,2.29,2025
...,...,...,...,...,...,...,...
195,3274,Catherine Velasquez,22,fsutton@gmail.com,Physics,2.71,2025
196,3609,Joyce Thomas,19,zanderson@barrera.net,Chemistry,2.22,2030
197,9179,Theresa Hughes,21,mstanley@yahoo.com,Mathematics,3.23,2025
198,4463,Steven Golden,19,nvasquez@yahoo.com,Computer Science,3.90,2025
199,6178,Miss April Smith,20,logansanchez@manning.com,Mathematics,3.15,2028

In [13]:
df.math_score.fillna(67)

<class 'AttributeError'>: 'DataFrame' object has no attribute 'math_score'

In [14]:
df.columns.values

array(['StudentID', 'Name', 'Age', 'Email', 'Department', 'GPA',
       'GraduationYear'], dtype=object)

In [15]:
df.iloc[20]

StudentID                            3052
Name                        Suzanne Lopez
Age                                    18
Email             thomasbennett@gmail.com
Department               Computer Science
GPA                                  2.33
GraduationYear                       2025
Name: 20, dtype: object

In [16]:
df.iloc[:,2:5]

     Age                          Email        Department
0     19             sean43@hotmail.com       Mathematics
1     23             vbecker@harvey.com         Chemistry
2     22           hollydavis@gmail.com           Physics
3     24  ganderson@wheeler-atkins.info           Physics
4     18           hayesdiane@gmail.com         Chemistry
..   ...                            ...               ...
195   22              fsutton@gmail.com           Physics
196   19          zanderson@barrera.net         Chemistry
197   21             mstanley@yahoo.com       Mathematics
198   19             nvasquez@yahoo.com  Computer Science
199   20       logansanchez@manning.com       Mathematics

[200 rows x 3 columns]

In [17]:
df.math_score.fillna(67, inplace=True)

<class 'AttributeError'>: 'DataFrame' object has no attribute 'math_score'

In [20]:
df

,StudentID,Name,Age,Email,Department,GPA,GraduationYear
0,3336,David Palmer,19,sean43@hotmail.com,Mathematics,3.16,2026
1,8774,Andrew Roach,23,vbecker@harvey.com,Chemistry,3.75,2027
2,1396,Jonathan Gonzalez,22,hollydavis@gmail.com,Physics,2.95,2027
3,6716,Kenneth Morrow,24,ganderson@wheeler-atkins.info,Physics,3.55,2029
4,8830,Kaitlyn Martinez,18,hayesdiane@gmail.com,Chemistry,2.29,2025
...,...,...,...,...,...,...,...
195,3274,Catherine Velasquez,22,fsutton@gmail.com,Physics,2.71,2025
196,3609,Joyce Thomas,19,zanderson@barrera.net,Chemistry,2.22,2030
197,9179,Theresa Hughes,21,mstanley@yahoo.com,Mathematics,3.23,2025
198,4463,Steven Golden,19,nvasquez@yahoo.com,Computer Science,3.90,2025
199,6178,Miss April Smith,20,logansanchez@manning.com,Mathematics,3.15,2028